Merge is used to add new columns from another dataframe to existing one by using different ways

In [1]:
import pandas as pd

In [11]:
df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Saran', 'Satish', 'Kamal', 'Kumar']
})
df1

   id    name
0   1   Saran
1   2  Satish
2   3   Kamal
3   4   Kumar

In [12]:
df2 = pd.DataFrame({
    'id': [1, 2, 5, 6],
    'score': [85, 90, 95, 100]
})
df2

   id  score
0   1     85
1   2     90
2   5     95
3   6    100

In [13]:
pd.merge(df1, df2, on='id', how='inner')

   id    name  score
0   1   Saran     85
1   2  Satish     90

In [14]:
pd.merge(df1, df2, on='id', how='left')

   id    name  score
0   1   Saran   85.0
1   2  Satish   90.0
2   3   Kamal    NaN
3   4   Kumar    NaN

In [15]:
pd.merge(df1,df2, on='id', how='right')

   id    name  score
0   1   Saran     85
1   2  Satish     90
2   5     NaN     95
3   6     NaN    100

In [16]:
pd.merge(df1, df2, on='id', how='outer')

   id    name  score
0   1   Saran   85.0
1   2  Satish   90.0
2   3   Kamal    NaN
3   4   Kumar    NaN
4   5     NaN   95.0
5   6     NaN  100.0

pd.merge(df1, df2, on='id', how='outer').score.fillna(df2.score.mean())

In [19]:
df3 = pd.DataFrame({
    'id': [1, 2, 3],
    'year': [2020, 2020, 2021],
    'grade': ['A', 'B', 'C']
})
df3

   id  year grade
0   1  2020     A
1   2  2020     B
2   3  2021     C

In [20]:
df4 = pd.DataFrame({
    'id': [1, 2, 4],
    'year': [2020, 2020, 2021],
    'score': [85, 90, 95]
})
df4

   id  year  score
0   1  2020     85
1   2  2020     90
2   4  2021     95

In [21]:
pd.merge(df3, df4, on=['id', 'year'], how='inner')

   id  year grade  score
0   1  2020     A     85
1   2  2020     B     90

In [22]:
pd.merge(df3, df4, on=['id', 'year'], how='outer')

   id  year grade  score
0   1  2020     A   85.0
1   2  2020     B   90.0
2   3  2021     C    NaN
3   4  2021   NaN   95.0

In [23]:
df5 = pd.DataFrame({
    'user_id': [1, 2, 5],
    'score': [85, 90, 95]
})
df5

   user_id  score
0        1     85
1        2     90
2        5     95

In [24]:
pd.merge(df1, df5, left_on='id', right_on='user_id', how='inner')

   id    name  user_id  score
0   1   Saran        1     85
1   2  Satish        2     90